{
  "carpet.rule.andesiteFunnelExtractAmount.desc": "The number of items andesite funnels should extract per pull",
  "carpet.rule.andesiteFunnelExtractAmount.extra.0": "Based on this pull request by Yarden-zamir: https://github.com/Creators-of-Create/Create/pull/5777",
  "carpet.rule.chuteExtractAmount.desc": "The number of items chutes should extract per pull",
  "carpet.rule.chuteExtractAmount.extra.0": "Based on this pull request by Yarden-zamir: https://github.com/Creators-of-Create/Create/pull/5777",
  "carpet.rule.creativePersistentGoggleOverlay.desc": "Renders the goggle overlay on the client in creative or spectator mode regardless of whether the player is wearing goggles",
  "carpet.rule.creativePersistentGoggleOverlay.extra.0": "Based on this pull request by T3sT3ro: https://github.com/Creators-of-Create/Create/pull/5778",
  "carpet.rule.deployerPlacementFix.desc": "Fixes deployers placing blocks too close to themselves when the target position is occupied",
  "carpet.rule.deployerPlacementFix.extra.0": "Based on this pull request by Larsianer: https://github.com/Creators-of-Create/Create/pull/6048",
  "carpet.rule.entityContraptionRotationFix.desc": "Fixes contraptions failing to orient the player as they move",
  "carpet.rule.entityContraptionRotationFix.extra.0": "Based on this pull request by tildejustin: https://github.com/Creators-of-Create/Create/pull/6089",
  "carpet.rule.expandedHopperCounters.desc": "Extends hopper counter behavior to andesite funnels, brass funnels, chutes, smart chutes and mechanical crafters",
  "carpet.rule.flowingBottomlessFluidFix.desc": "Fixes flowing fluids being counted towards a \"bottomless\" body",
  "carpet.rule.flowingBottomlessFluidFix.extra.0": "Based on this pull request by IThundxr: https://github.com/Creators-of-Create/Create/pull/6036",
  "carpet.rule.fluidCounters.desc": "Fluid influx across a timespan can be measured using wool blocks",
  "carpet.rule.mechanicalRollerDropChance.desc": "The chance of a mechanical roller dropping the block it breaks as an item",
  "carpet.rule.renewableBlazeCakes.desc": "Pipes can suck the lava out of magma blocks, converting them to netherrack",
  "carpet.rule.respectRespectData.desc": "Fixes the Respect Data button in list filters not actually respecting the items' datas",
  "carpet.rule.respectRespectData.extra.0": "Based on this pull request by voidLeech: https://github.com/Creators-of-Create/Create/pull/5971",
  "carpet.rule.respectRespectData.extra.1": "You will need to take and reinsert the list filter after modifying this rule.",
  "carpet.rule.stationDupeFix.desc": "Fixes stations getting broken when an intersecting train disassembles, while also replacing the block in the train",
  "carpet.rule.stationDupeFix.extra.0": "Based on this pull request by cakeGit: https://github.com/Creators-of-Create/Create/pull/6088",
  "carpet.rule.suppressSpawnDataLogError.desc": "Suppresses the ExtraSpawnDataEntity spawn data error message, which is spammed every time a self-adhered oscillating gantry carriage reverses direction",
  "carpet.rule.suppressSpawnDataLogError.extra.0": "This does not fix the underlying issue that causes the message. It just stops the message from showing in the client log.",
  "carpet.rule.tickSyncedCreateAnimations.desc": "Create contraption animations obey the tick rate and freeze status of the world",
  "carpet.rule.tickSyncedCreateAnimations.extra.0": "Note: this rule is still in active development. You should expect vanilla behavior for a handful of contraption actors.",
  "carpet.rule.toolboxItemDupeFix.desc": "Fixes droppers not respecting item NBT on moving contraptions when ejecting, allowing empty toolboxes to pair with pre-filled ones",
  "carpet.rule.toolboxItemDupeFix.extra.0": "Based on this pull request by IThundxr: https://github.com/Creators-of-Create/Create/pull/6062"
}
